/*#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

/*
ASCII

char -> int
'1' - '0' = 1
'3' - '0' = 3
'0' = 48
'1' = 49

int -> char
char = int + '0'
'1' = 1 + '0' 
*/



/*
>> 右移操作符
1.逻辑右移 -> 右边丢弃，左边补0
2.算术右移 -> 右边丢弃，左边补原符号位(>>)

**右移n位相当于除以2的n次方

<< 左移操作符
左边丢弃，右边补0

**左移n位相当于乘以2的n次方

移位操作符不能移动负数位，这是标准未定义的
int a = 1;
a >> -1 //error
*/
//int main() {
//	int a = 16;
//	//00000000000000000000000000010000
//	int b = a >> 1;//8
//	//00000000000000000000000000001000
//	int c = a << 1;
//	printf("%d\n", b);
//	//00000000000000000000000000100000
//	printf("%d\n", c);
//	return 0;
//}

/*
整数的二进制表示有：原码，反码，补码
正整数 -> 原码=反码=补码
存储到内存的是补码
原码->反码:符号位不变，其他按位取反
反码->补码：反码+1
*/
//int main() {
//	int a = -1;
//	//100000000000000000000000000000001   - 原码
//	//111111111111111111111111111111110   - 反码
//	//111111111111111111111111111111111   - 补码
//	//ff ff ff ff - 内存
//	int b = a >> 2;//8
//	//111111111111111111111111111111111
//	int c = a << 2;
//	printf("%d\n", b);
//	//111111111111111111111111111111110   - 补码
//	//111111111111111111111111111111101   - 反码
//	//100000000000000000000000000000010   - 原码  = -2
//	printf("%d\n", c);
//	return 0;
//}


